# Задача "Все ли равны?"

first = input('Введите целое число: ')
second = input('Введите целое число: ')
third = input('Введите целое число: ')

if first == second == third:
    print(3)
elif first != second != third:
    print(0)
else:
    print(2)